#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ssm_parameter.public_subnets_cidr_block: Refreshing state... [id=/dev/my_vpc/public_subnets_cidr_block]
aws_ssm_parameter.private_subnets_cidr_block: Refreshing state... [id=/dev/my_vpc/private_subnets_cidr_block]
module.my_vpc.module.my_vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b3bdd28f1b4a3274]
module.my_vpc.module.my_vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f27e419b20f77d18]
aws_ssm_parameter.vpc_default_security_group_id: Refreshing state... [id=/dev/my_vpc/subnets/vpc_default_security_group_id]
module.my_vpc.module.my_vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-098332943b198d749]
aws_ssm_parameter.vpc_id: Refreshing state... [id=/dev/my_vpc/vpc_id]
module.my_vpc.module.my_vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-029dc178e6836e359]
module.my_vpc.module.my_vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e8ec797a3b189051]
aws_ssm_parameter.vpc_cidr_block: Refreshing state... [id=/dev/my_vpc/vpc_cidr_block]
module.my_vpc.module.my_vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0975e1c26521257a0]
module.my_vpc.module.my_vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-05deb562cfd1c6886]
module.my_vpc.module.my_vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0130a9ec6336c4797]
module.my_vpc.module.my_vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d53a2df7850a410e]
module.my_vpc.module.my_vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06dabf7cb009ac15b]
module.my_vpc.module.my_vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-058f756e658488125]
module.my_vpc.module.my_vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0408ef5de09562d44]
aws_ssm_parameter.public_subnets_id: Refreshing state... [id=/dev/my_vpc/subnets/public_subnets_id]
module.my_vpc.module.my_vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=my-vpc]
module.my_vpc.module.my_vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0d0da645206f78b13]
module.my_vpc.module.my_vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0886d19fd323975c2]
module.my_vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b4afa6a6848571db]
module.my_vpc.module.my_vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0caea1b317f77bb0d]
module.my_vpc.module.my_vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06dabf7cb009ac15b1080289494]
module.my_vpc.module.my_vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e30fccb9ffa83017]
aws_ssm_parameter.private_subnets_id: Refreshing state... [id=/dev/my_vpc/subnets/private_subnets_id]
module.my_vpc.module.my_vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-061734d0b0b3f30b8]
module.my_vpc.module.my_vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d53a2df7850a410e1080289494]
aws_ssm_parameter.database_subnet_group: Refreshing state... [id=/dev/my_vpc/subnets/database_subnet_group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_vpc.module.my_vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0b3bdd28f1b4a3274"

      + destination_options {
          + file_format                = "plain-text"
          + hive_compatible_partitions = false
          + per_hour_partition         = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @OriAvr, Action: `pull_request`*